BitBoxSwiss/bitbox02-firmware/external/ST/Drivers/CMSIS/Device/ST/STM32U5xx/Source/Templates/arm/startup_stm32u545xx.s
__Vectors_Size  EQU    __Vectors_End - __Vectors

                AREA    |.text|, CODE, READONLY


; Reset Handler

Reset_Handler   PROC
                EXPORT  Reset_Handler             [WEAK]
                IMPORT  SystemInit
                IMPORT  __main
                LDR     R0, =SystemInit
                BLX     R0
                LDR     R0, =__main
                BX      R0
                ENDP


; Dummy Exception Handlers (infinite loops which can be modified)

NMI_Handler\
                PROC
                EXPORT  NMI_Handler               [WEAK]
                B       .
                ENDP
HardFault_Handler\
                PROC
                EXPORT  HardFault_Handler         [WEAK]
                B       .
                ENDP
MemManage_Handler\
                PROC
                EXPORT  MemManage_Handler         [WEAK]
                B       .
                ENDP
BusFault_Handler\
                PROC
                EXPORT  BusFault_Handler          [WEAK]
                B       .
                ENDP
UsageFault_Handler\
                PROC
                EXPORT  UsageFault_Handler        [WEAK]
                B       .
                ENDP
SecureFault_Handler\
                PROC
                EXPORT  SecureFault_Handler       [WEAK]
                B       .
                ENDP
SVC_Handler\
                PROC
                EXPORT  SVC_Handler               [WEAK]
                B       .
                ENDP
DebugMon_Handler\
                PROC
                EXPORT  DebugMon_Handler          [WEAK]
                B       .
                ENDP
PendSV_Handler\
                PROC
                EXPORT  PendSV_Handler            [WEAK]
                B       .
                ENDP
SysTick_Handler\
                PROC
                EXPORT  SysTick_Handler           [WEAK]
                B       .
                ENDP

Default_Handler PROC

                EXPORT  WWDG_IRQHandler              [WEAK]
                EXPORT  PVD_PVM_IRQHandler           [WEAK]
                EXPORT  RTC_IRQHandler               [WEAK]
                EXPORT  RTC_S_IRQHandler             [WEAK]
                EXPORT  TAMP_IRQHandler              [WEAK]
                EXPORT  RAMCFG_IRQHandler            [WEAK]
                EXPORT  FLASH_IRQHandler             [WEAK]
                EXPORT  FLASH_S_IRQHandler           [WEAK]
                EXPORT  GTZC_IRQHandler              [WEAK]
                EXPORT  RCC_IRQHandler               [WEAK]
                EXPORT  RCC_S_IRQHandler             [WEAK]
                EXPORT  EXTI0_IRQHandler             [WEAK]
                EXPORT  EXTI1_IRQHandler             [WEAK]
                EXPORT  EXTI2_IRQHandler             [WEAK]
                EXPORT  EXTI3_IRQHandler             [WEAK]
                EXPORT  EXTI4_IRQHandler             [WEAK]
                EXPORT  EXTI5_IRQHandler             [WEAK]
                EXPORT  EXTI6_IRQHandler             [WEAK]
                EXPORT  EXTI7_IRQHandler             [WEAK]
                EXPORT  EXTI8_IRQHandler             [WEAK]
                EXPORT  EXTI9_IRQHandler             [WEAK]
                EXPORT  EXTI10_IRQHandler            [WEAK]
                EXPORT  EXTI11_IRQHandler            [WEAK]
                EXPORT  EXTI12_IRQHandler            [WEAK]
                EXPORT  EXTI13_IRQHandler            [WEAK]
                EXPORT  EXTI14_IRQHandler            [WEAK]
                EXPORT  EXTI15_IRQHandler            [WEAK]
                EXPORT  IWDG_IRQHandler              [WEAK]
                EXPORT  SAES_IRQHandler              [WEAK]
                EXPORT  GPDMA1_Channel0_IRQHandler   [WEAK]
                EXPORT  GPDMA1_Channel1_IRQHandler   [WEAK]
                EXPORT  GPDMA1_Channel2_IRQHandler   [WEAK]
                EXPORT  GPDMA1_Channel3_IRQHandler   [WEAK]
                EXPORT  GPDMA1_Channel4_IRQHandler   [WEAK]
                EXPORT  GPDMA1_Channel5_IRQHandler   [WEAK]
                EXPORT  GPDMA1_Channel6_IRQHandler   [WEAK]
                EXPORT  GPDMA1_Channel7_IRQHandler   [WEAK]
                EXPORT  ADC1_IRQHandler              [WEAK]
                EXPORT  DAC1_IRQHandler              [WEAK]
                EXPORT  FDCAN1_IT0_IRQHandler        [WEAK]
                EXPORT  FDCAN1_IT1_IRQHandler        [WEAK]
                EXPORT  TIM1_BRK_IRQHandler          [WEAK]
                EXPORT  TIM1_UP_IRQHandler           [WEAK]
                EXPORT  TIM1_TRG_COM_IRQHandler      [WEAK]
                EXPORT  TIM1_CC_IRQHandler           [WEAK]
                EXPORT  TIM2_IRQHandler              [WEAK]
                EXPORT  TIM3_IRQHandler              [WEAK]
                EXPORT  TIM4_IRQHandler              [WEAK]
                EXPORT  TIM5_IRQHandler              [WEAK]
                EXPORT  TIM6_IRQHandler              [WEAK]
                EXPORT  TIM7_IRQHandler              [WEAK]
                EXPORT  TIM8_BRK_IRQHandler          [WEAK]
                EXPORT  TIM8_UP_IRQHandler           [WEAK]
                EXPORT  TIM8_TRG_COM_IRQHandler      [WEAK]
                EXPORT  TIM8_CC_IRQHandler           [WEAK]
                EXPORT  I2C1_EV_IRQHandler           [WEAK]
                EXPORT  I2C1_ER_IRQHandler           [WEAK]
                EXPORT  I2C2_EV_IRQHandler           [WEAK]
                EXPORT  I2C2_ER_IRQHandler           [WEAK]
                EXPORT  SPI1_IRQHandler              [WEAK]
                EXPORT  SPI2_IRQHandler              [WEAK]
                EXPORT  USART1_IRQHandler            [WEAK]
                EXPORT  USART3_IRQHandler            [WEAK]
                EXPORT  UART4_IRQHandler             [WEAK]
                EXPORT  UART5_IRQHandler             [WEAK]
                EXPORT  LPUART1_IRQHandler           [WEAK]
                EXPORT  LPTIM1_IRQHandler            [WEAK]
                EXPORT  LPTIM2_IRQHandler            [WEAK]
                EXPORT  TIM15_IRQHandler             [WEAK]
                EXPORT  TIM16_IRQHandler             [WEAK]
                EXPORT  TIM17_IRQHandler             [WEAK]
                EXPORT  COMP_IRQHandler              [WEAK]
                EXPORT  USB_IRQHandler               [WEAK]
                EXPORT  CRS_IRQHandler               [WEAK]
                EXPORT  OCTOSPI1_IRQHandler          [WEAK]
                EXPORT  PWR_S3WU_IRQHandler          [WEAK]
                EXPORT  SDMMC1_IRQHandler            [WEAK]
                EXPORT  GPDMA1_Channel8_IRQHandler   [WEAK]
                EXPORT  GPDMA1_Channel9_IRQHandler   [WEAK]
                EXPORT  GPDMA1_Channel10_IRQHandler  [WEAK]
                EXPORT  GPDMA1_Channel11_IRQHandler  [WEAK]
                EXPORT  GPDMA1_Channel12_IRQHandler  [WEAK]
                EXPORT  GPDMA1_Channel13_IRQHandler  [WEAK]
                EXPORT  GPDMA1_Channel14_IRQHandler  [WEAK]
                EXPORT  GPDMA1_Channel15_IRQHandler  [WEAK]
                EXPORT  I2C3_EV_IRQHandler           [WEAK]
                EXPORT  I2C3_ER_IRQHandler           [WEAK]
                EXPORT  SAI1_IRQHandler              [WEAK]
                EXPORT  TSC_IRQHandler               [WEAK]
                EXPORT  AES_IRQHandler               [WEAK]
                EXPORT  RNG_IRQHandler               [WEAK]
                EXPORT  FPU_IRQHandler               [WEAK]
                EXPORT  HASH_IRQHandler              [WEAK]
                EXPORT  PKA_IRQHandler               [WEAK]
                EXPORT  LPTIM3_IRQHandler            [WEAK]
                EXPORT  SPI3_IRQHandler              [WEAK]
                EXPORT  I2C4_ER_IRQHandler           [WEAK]
                EXPORT  I2C4_EV_IRQHandler           [WEAK]
                EXPORT  MDF1_FLT0_IRQHandler         [WEAK]
                EXPORT  MDF1_FLT1_IRQHandler         [WEAK]
                EXPORT  ICACHE_IRQHandler            [WEAK]
                EXPORT  OTFDEC1_IRQHandler           [WEAK]
                EXPORT  LPTIM4_IRQHandler            [WEAK]
                EXPORT  DCACHE1_IRQHandler           [WEAK]
                EXPORT  ADF1_IRQHandler              [WEAK]
                EXPORT  ADC4_IRQHandler              [WEAK]
                EXPORT  LPDMA1_Channel0_IRQHandler   [WEAK]
                EXPORT  LPDMA1_Channel1_IRQHandler   [WEAK]
                EXPORT  LPDMA1_Channel2_IRQHandler   [WEAK]
                EXPORT  LPDMA1_Channel3_IRQHandler   [WEAK]
                EXPORT  DCMI_PSSI_IRQHandler         [WEAK]
                EXPORT  OCTOSPI2_IRQHandler          [WEAK]
                EXPORT  CORDIC_IRQHandler            [WEAK]
                EXPORT  FMAC_IRQHandler              [WEAK]
                EXPORT  LSECSSD_IRQHandler           [WEAK]

WWDG_IRQHandler
PVD_PVM_IRQHandler
RTC_IRQHandler
RTC_S_IRQHandler
TAMP_IRQHandler
RAMCFG_IRQHandler
FLASH_IRQHandler
FLASH_S_IRQHandler
GTZC_IRQHandler
RCC_IRQHandler
RCC_S_IRQHandler
EXTI0_IRQHandler
EXTI1_IRQHandler
EXTI2_IRQHandler
EXTI3_IRQHandler
EXTI4_IRQHandler
EXTI5_IRQHandler
EXTI6_IRQHandler
EXTI7_IRQHandler
EXTI8_IRQHandler
EXTI9_IRQHandler
EXTI10_IRQHandler
EXTI11_IRQHandler
EXTI12_IRQHandler
EXTI13_IRQHandler
EXTI14_IRQHandler
EXTI15_IRQHandler
IWDG_IRQHandler
SAES_IRQHandler
GPDMA1_Channel0_IRQHandler
GPDMA1_Channel1_IRQHandler
GPDMA1_Channel2_IRQHandler
GPDMA1_Channel3_IRQHandler
GPDMA1_Channel4_IRQHandler
GPDMA1_Channel5_IRQHandler
GPDMA1_Channel6_IRQHandler
GPDMA1_Channel7_IRQHandler
ADC1_IRQHandler
DAC1_IRQHandler
FDCAN1_IT0_IRQHandler
FDCAN1_IT1_IRQHandler
TIM1_BRK_IRQHandler
TIM1_UP_IRQHandler
TIM1_TRG_COM_IRQHandler
TIM1_CC_IRQHandler
TIM2_IRQHandler
TIM3_IRQHandler
TIM4_IRQHandler
TIM5_IRQHandler
TIM6_IRQHandler
TIM7_IRQHandler
TIM8_BRK_IRQHandler
TIM8_UP_IRQHandler
TIM8_TRG_COM_IRQHandler
TIM8_CC_IRQHandler
I2C1_EV_IRQHandler
I2C1_ER_IRQHandler
I2C2_EV_IRQHandler
I2C2_ER_IRQHandler
SPI1_IRQHandler
SPI2_IRQHandler
USART1_IRQHandler
USART3_IRQHandler
UART4_IRQHandler
UART5_IRQHandler
LPUART1_IRQHandler
LPTIM1_IRQHandler
LPTIM2_IRQHandler
TIM15_IRQHandler
TIM16_IRQHandler
TIM17_IRQHandler
COMP_IRQHandler
USB_IRQHandler
CRS_IRQHandler
OCTOSPI1_IRQHandler
PWR_S3WU_IRQHandler
SDMMC1_IRQHandler
GPDMA1_Channel8_IRQHandler
GPDMA1_Channel9_IRQHandler
GPDMA1_Channel10_IRQHandler
GPDMA1_Channel11_IRQHandler
GPDMA1_Channel12_IRQHandler
GPDMA1_Channel13_IRQHandler
GPDMA1_Channel14_IRQHandler
GPDMA1_Channel15_IRQHandler
I2C3_EV_IRQHandler
I2C3_ER_IRQHandler
SAI1_IRQHandler
TSC_IRQHandler
AES_IRQHandler
RNG_IRQHandler
FPU_IRQHandler
HASH_IRQHandler
PKA_IRQHandler
LPTIM3_IRQHandler
SPI3_IRQHandler
I2C4_ER_IRQHandler
I2C4_EV_IRQHandler
MDF1_FLT0_IRQHandler
MDF1_FLT1_IRQHandler
ICACHE_IRQHandler
OTFDEC1_IRQHandler
LPTIM4_IRQHandler
DCACHE1_IRQHandler
ADF1_IRQHandler
ADC4_IRQHandler
LPDMA1_Channel0_IRQHandler
LPDMA1_Channel1_IRQHandler
LPDMA1_Channel2_IRQHandler
LPDMA1_Channel3_IRQHandler
DCMI_PSSI_IRQHandler
OCTOSPI2_IRQHandler
CORDIC_IRQHandler
FMAC_IRQHandler
LSECSSD_IRQHandler

                B       .

                ENDP

                ALIGN

;*******************************************************************************
; User Stack and Heap initialization
;*******************************************************************************
                IF      :DEF:__MICROLIB

                EXPORT  __initial_sp
                EXPORT  __heap_base
                EXPORT  __heap_limit

                ELSE

                IMPORT  __use_two_region_memory
                EXPORT  __user_initial_stackheap

__user_initial_stackheap PROC
                LDR     R0, =  Heap_Mem
                LDR     R1, =(Stack_Mem + Stack_Size)
                LDR     R2, = (Heap_Mem +  Heap_Size)
                LDR     R3, = Stack_Mem
                BX      LR
                ENDP

                ALIGN

                ENDIF

                END
